Tekla Open API Reference for Tekla Structures 2025
FacetedBrep.GetEdges Property
 Gets the edges.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<IndirectPolymeshEdge> GetEdges { get; }
Public ReadOnly Property GetEdges As IList(Of IndirectPolymeshEdge)
	Get
Property Value
Type: IList<IndirectPolymeshEdge>
See Also
Reference
FacetedBrep Class
Tekla.Structures.Geometry3d Namespace